
(defparameter *buki-list*
  '("もげぞーの剣" "ナイフ" "木の枝" 
    "木刀" "ダガー" "メイス"
    "鎌" "ショートソード" "スピア" "ヌンチャク" "ブロードソード" "シミター"
    "レイピア" "鉄の剣" "ジャベリン" "ミスリルナイフ" "サーベル" "銅の剣"
    "バトルアクス" "銀の剣" "金の剣" "フォールチュン" "チャクラム" "ウェアバスター"
    "ちからのつえ" "ファルシオン" "グレートアクス" "ツーハンドソード" "猫の爪"
    "グレートソード" "ククリ" "バスタードソード" "クレイモア" "モーニングスター"
    "バルディッシュ" "パルチザン" "マインゴーシュ" "シャムシール" "ウォーハンマー"
    "ルーンブレード" "さんごのつるぎ" "ディフェンダー" "ブリューナク" "ソードブレイカー"
    "レーヴァテイン" "オートクレール" "正宗" "ゲイボルグ" "エクスカリバー" "ラグナロク" 
    "あれくまブレード" "もげぞうの剣" "ハツネツの剣" "メタルヨテイチの剣"))

(defvar *buki-list-len* (length *buki-list*))

